##################################################################
# Copyright Micro Focus International Ltd 1996-1998.
# All Rights Reserved.
##################################################################
 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROBLEMA11.
##################################################################
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
 INPUT-OUTPUT SECTION.
#--------------------
 FILE-CONTROL.
# Fichero de ENTRADA de CENSO

 SELECT CENSO ASSIGN TO "/uploads/censo.txt"
 ORGANIZATION IS LINE SEQUENTIAL
 ACCESS IS SEQUENTIAL
 FILE STATUS IS FS-CENSO.

# Fichero de SALIDA de INFORME

 SELECT INFORME ASSIGN TO "/myfiles/INFORME.TXT"
 ORGANIZATION IS SEQUENTIAL
 ACCESS IS SEQUENTIAL
 FILE STATUS IS FS-INFORME.

#Fichero de ordenación SORT
 SELECT FSORT ASSIGN TO SORTFILE.


 DATA DIVISION.
#-------------
 FILE SECTION.
#------------
 SD FSORT.
 01 REGISTRO-SORT.
 05 SORT-NUM PIC 9(7) VALUE ZEROS.
 05 SORT-APELLIDO PIC X(20) VALUE SPACES.
 05 SORT-REGION PIC X(9) VALUE SPACES.


# DECRIPCIÓN Fichero de ENTRADA de CENSO
 FD CENSO
 LABEL RECORD ARE STANDARD
 BLOCK CONTAINS 0 RECORDS
 RECORDING MODE IS F.
 01 REG-CENSO PIC X(38) VALUE SPACES.

# DECRIPCIÓN Fichero de SALIDA INFORME (MODIFICAR ESTO)
 FD INFORME.
 01 REG-INFORME PIC X(132).

# YYMMDD
 01 FECHA-ACTUAL.
 02 ACTUALYear PIC 9(4).
 02 ACTUALMonth PIC 99.
 02 ACTUALDay PIC 99.

 WORKING-STORAGE SECTION.
#-----------------------
#VARIABLES DE ESTADO DE FICHEROS
 01 FS-CENSO PIC X(2) VALUE '00'.
 01 FS-ALUMNOS PIC X(2) VALUE '00'.
 01 FS-INFORME PIC X(2) VALUE '00'.

 01 LD-FECHA.
 05 D-FECHA-DAY PIC 9(2).
 05 FILLER PIC X(1) VALUE '/'.
 05 D-FECHA-MONTH PIC 9(2).
 05 FILLER PIC X(1) VALUE '/'.
 05 D-FECHA-YEAR PIC 9(4).

#VARIABLES DE ESTADO DE FIN DE FICHEROS
 01 SW-FIN-SORT PIC X.
 88 FIN-SORT VALUE 'S'.
 88 NO-FIN-SORT VALUE 'N'.

#VARIABLES DE ESTADO DE FIN DE FICHEROS
 01 SW-FIN-CENSO PIC X.
 88 FIN-CENSO VALUE 'S'.
 88 NO-FIN-CENSO VALUE 'N'.

#VARIABLES DE ESTADO DE APERTURA DE FICHERO ATICULOS
 01 SW-ERROR-OPEN-CENSO PIC X.
 88 OPEN-KO-CENSO VALUE 'S'.
 88 NO-OPEN-KO-CENSO VALUE 'N'.

#VARIABLES DE ESTADO DE APERTURA DE FICHERO IMPRESION
 01 SW-ERROR-OPEN-IMPRE PIC X.
 88 OPEN-KO-IMPRE VALUE 'S'.
 88 NO-OPEN-K0-IMPRE VALUE 'N'.

#VARIABLES DE ESTADO DE APERTURA DE FICHERO IMPRESION
 01 SW-ERROR-APERTURA PIC X.
 88 ERROR-APERTURA VALUE 'S'.
 88 NO-ERROR-APERTURA VALUE 'N'.

#VARIABLES DE ESTADO DE LECTURA FICHERO CENSO
 01 SW-ERROR-READ-CENSO PIC X.
 88 ERROR-READ-CENSO VALUE 'S'.
 88 NO-ERROR-READ-CENSO VALUE 'N'.

#VARIABLES DE ESTADO ERROR EN UNSTRING
 01 SW-ERROR-UNSTRING PIC X.
 88 ERROR-UNSTRING VALUE 'S'.
 88 NO-ERROR-UNSTRING VALUE 'N'.

#VARIABLES PARA COMPUTO LISTADO Y LECTURA
 01 WS-CONT-LINEAS PIC 9(2) VALUE ZEROS.
 01 WS-CONT-APELLIDO PIC 9(6) VALUE ZEROS.
 01 WS-CONT-PAG PIC 9(3) VALUE ZEROS.
 01 WS-CONT-REG-CENSO PIC 9(6) VALUE ZEROS.
 01 WSED-CONT-REG-CENSO PIC ZZ,ZZ9.
 01 WS-INDICE PIC 9(2) VALUE ZEROS.
 01 WS-I1 PIC 9(2) VALUE ZEROS.
 01 WS-WS-I2 PIC 9(2) VALUE ZEROS.
 01 WS-LINEA-IMPRESION PIC 9(2) VALUE ZEROS.
 01 WS-CONT-TABLA PIC 9(2) VALUE ZEROS.
 01 WS-APELLIDO-ANTERIOR PIC X(20) VALUE SPACES.
 01 WS-REGION-ANTERIOR PIC X(9) VALUE SPACES.
 01 WS-CONT-SORT PIC 9(8) VALUE ZEROS.
 01 WS-CONT-CENSO PIC 9(8) VALUE ZEROS.

# VARIABLES PARA LECTURA DEL SORT
 01 WRS-REG-SORT.
 05 WRS-NUM-ACTUAL PIC 9(7) VALUE ZEROS.
 05 WRS-APELLIDO-ACTUAL PIC X(20) VALUE SPACES.
 05 WRS-REGION-ACTUAL PIC X(9) VALUE SPACES.

#WORKING PARA FICHERO ENTRADA CENSO (7,20,9)
 01 WS-REG-CENSO PIC X(38) VALUE SPACES.
 01 WK-REG-CENSO.
 03 WK-CENSO-NUM PIC X(7) VALUE ZEROS.
 03 WK-CENSO-APELLIDO PIC X(20) VALUE SPACES.
 03 WK-CENSO-REGION PIC X(9) VALUE SPACES.

# LÍNEA DE FECHA Y NÚMERO DE PÁGINA
 01 LI-REG-CAB0.
 03 FILLER PIC X(2) VALUE SPACES.
 03 LT-FECHA.
 05 LT-FECHA-DAY PIC 9(2).
 05 FILLER PIC X(1) VALUE '/'.
 05 LT-FECHA-MONTH PIC 9(2).
 05 FILLER PIC X(1) VALUE '/'.
 05 LT-FECHA-YEAR PIC 9(4).
 03 FILLER PIC X(110) VALUE SPACES.
 03 FILLER PIC X(5) VALUE 'PAG: '.
 03 LT-PAGE PIC Z9.

# LÍNEAS DE TÍTULO
 01 LI-REG-CAB1.
 03 FILLER PIC X(59) VALUE SPACES.
 03 LC-DETALLE PIC X(15)
 VALUE 'PGM PROBLEMA 10'.
 03 FILLER PIC X(58) VALUE SPACES.

 01 LI-REG-CAB2.
 03 FILLER PIC X(41) VALUE SPACES.
 03 LC-DETALLE PIC X(50) VALUE
 'INFORME DE LOS 10 APELLIDOS MAS COMUNES POR REGION'.
 03 FILLER PIC X(41) VALUE SPACES.

# LÍNEA DE IDENTIFICACIÓN DE LA REGIÓN
 01 LI-REG-REGION.
 03 FILLER PIC X(10) VALUE SPACES.
 03 FILLER PIC X(9) VALUE
 "REGION: ".
 03 LD-REGION PIC ZZ9.
 03 FILLER PIC X VALUE SPACES.
 03 FILLER PIC X(93) VALUE ALL '.'.
 03 FILLER PIC X VALUE SPACES.
 03 FILLER PIC X(5) VALUE "TOTAL".
 03 FILLER PIC X(10) VALUE SPACES.

# LÍNEA DE DETALLE DE LISTADO
 01 LI-REG-DETALLE.
 03 FILLER PIC X(10) VALUE SPACES.
 03 LD-APELLIDO PIC X(20) VALUE SPACES.
 03 FILLER PIC X(85) VALUE SPACES.
 03 LD-NUMERO PIC ZZZ,ZZZ.
 03 FILLER PIC X(10) VALUE SPACES.

# LÍNEA DE AUTOR DEL PROGRAMA
 01 LI-REG-AUTOR.
 03 FILLER PIC X(2) VALUE SPACES.
 03 FILLER PIC X(29)
 VALUE "PROGRAMADO POR: ANGEL DE TENA".

# LÍNEA DE FIN DE INFORME
 01 LI-REG-FIN.
 03 FILLER PIC X(2) VALUE SPACES.
 03 FILLER PIC X(15)
 VALUE "FIN DEL INFORME".
# TABLA PARA ALMACENAR LOS 10 APELLIDOS MAS COMUNES DE CADA
# REGIÓN
 01 TABLA-INFORME.
 03 TABLA-REGION PIC X(9) VALUE SPACES.
 03 TABLA-DATOS OCCURS 10 TIMES.
 05 CONTAP PIC 9(7) VALUE ZEROS.
 05 APTABLA PIC X(20) VALUE SPACES.

 PROCEDURE DIVISION.
#------------------
 INICIO.
# ACEPTAMOS FECHA DEL SISTEMA
 ACCEPT FECHA-ACTUAL FROM DATE YYYYMMDD.
 MOVE ACTUALYear TO LT-FECHA-YEAR D-FECHA-YEAR.
 MOVE ACTUALMonth TO LT-FECHA-MONTH D-FECHA-MONTH.
 MOVE ACTUALDay TO LT-FECHA-DAY D-FECHA-DAY.

# INICIALIZACION DE VARIABLES
 PERFORM INICIAR-VARIABLES
 THRU INICIAR-VARIABLES-EXIT.

# APERTURA DE FICHEROS IMPLICADOS
 PERFORM APERTURA-FICHEROS
 THRU APERTURA-FICHEROS-EXIT.

# PRIMERA LECTURA DE FICHERO DE CENSO SI APERTURAS OK
# PROCEDIMIENTO DE ENTRADA Y SALIDA PARA SORT
 IF NO-ERROR-APERTURA
 SORT FSORT ON ASCENDING SORT-REGION, SORT-APELLIDO
 INPUT PROCEDURE SORT-ENTRADA THRU SORT-ENTRADA-EXIT
 OUTPUT PROCEDURE SORT-SALIDA THRU SORT-SALIDA-EXIT
 END-IF.

# FINALIZACION DEL PROGRAMA
 PERFORM FINALIZAR
 THRU FINALIZAR-EXIT.

# PARADA DEL PROGRAMA
 STOP RUN.

 INICIAR-VARIABLES.
 INITIALIZE WS-REG-CENSO WS-CONT-CENSO.
 MOVE 39 TO WS-CONT-LINEAS.
 SET NO-FIN-CENSO NO-ERROR-APERTURA
 NO-OPEN-KO-CENSO NO-OPEN-K0-IMPRE
 NO-FIN-SORT TO TRUE.
 INICIAR-VARIABLES-EXIT.
 EXIT.

 APERTURA-FICHEROS.
 OPEN INPUT CENSO OUTPUT INFORME.
 EVALUATE TRUE
 WHEN FS-CENSO NOT = '00' SET OPEN-KO-CENSO TO TRUE
 WHEN FS-INFORME NOT = '00' SET OPEN-KO-IMPRE TO TRUE
 END-EVALUATE.
 IF OPEN-KO-CENSO OR
 OPEN-KO-IMPRE SET ERROR-APERTURA TO TRUE
 DISPLAY "ERROR EN LA APERTURA DE FICHEROS."
 DISPLAY "FILES STATUS DE FICHEROS."
 DISPLAY "FS-CENSO: " FS-CENSO
 DISPLAY "FS-INFORME: " FS-INFORME
 END-IF.
 APERTURA-FICHEROS-EXIT.
 EXIT.

 SORT-ENTRADA.
# BUCLE LECTURA DEL FICHERO DE CENSO HASTA FINAL FICHERO
# SE ORDENA EL FICHERO DE ENTRADA POR REGION Y APELLIDO
 PERFORM LECTURA-CENSO
 THRU LECTURA-CENSO-EXIT
 UNTIL FIN-CENSO.
 SORT-ENTRADA-EXIT.
 EXIT.

# LECTURA SECUENCIAL DEL FICHERO DE CENSO.SEPARACIÓN DE CAMPOS
# SEPARADOS POR COMAS DEL FICHERO DE ENTRADA MEDIANTE UNSTRING
 LECTURA-CENSO.
 INITIALIZE WS-REG-CENSO WK-REG-CENSO.
 SET NO-ERROR-UNSTRING TO TRUE.
 READ CENSO INTO WS-REG-CENSO
 AT END SET FIN-CENSO TO TRUE
 NOT AT END
 ADD 1 TO WS-CONT-CENSO
 UNSTRING WS-REG-CENSO DELIMITED BY ","
 INTO
 WK-CENSO-NUM WK-CENSO-APELLIDO WK-CENSO-REGION
 ON OVERFLOW
 DISPLAY
 "ERROR EN EL TRATAMIENTO DEL FICHERO CENSO"
 DISPLAY "REGISTRO: " WS-REG-CENSO
 DISPLAY "NO SE TRATÓ EL REGISTRO"
 SET ERROR-UNSTRING TO TRUE
 END-READ.
# SI TODO OK, GRABAMOS REGISTRO DE SORT YA ORDENADO POR REGION
# Y APELLIDO
 IF NO-ERROR-UNSTRING AND NO-FIN-CENSO
 INITIALIZE REGISTRO-SORT
 RELEASE REGISTRO-SORT FROM WK-REG-CENSO
 ADD 1 TO WS-CONT-SORT
 END-IF.

 LECTURA-CENSO-EXIT.
 EXIT.

# PROCEDIMIENTO DE SALIDA HASTA FIN SORT
# REALIZAMOS LA PRIMERA LECTURA DEL SORT ACCEDEMOS A
# BUCLE PRINCIPAL, SI NO ESTÁ VACÍO, CONTROLAMOS EL INFORME DEL
# ULTIMO BLOQUE DE APELLIDOS TRATADO
 SORT-SALIDA.
 PERFORM RECUPERAR-SORT
 THRU RECUPERAR-SORT-EXIT.
 IF NO-FIN-SORT
 INITIALIZE WS-APELLIDO-ANTERIOR WS-REGION-ANTERIOR
 TABLA-INFORME
 MOVE WRS-APELLIDO-ACTUAL TO WS-APELLIDO-ANTERIOR
 MOVE WRS-REGION-ACTUAL TO WS-REGION-ANTERIOR
 TABLA-REGION
 PERFORM BUCLE-PRINCIPAL
 THRU BUCLE-PRINCIPAL-EXIT
 UNTIL FIN-SORT
# GRABADO DEL ULTIMO PAQUETE DE APELLIDOS PARA LA REGIÓN
 PERFORM GRABAR-TABLA
 THRU GRABAR-TABLA-EXIT
 PERFORM GENERAR-LISTADO
 THRU GENERAR-LISTADO-EXIT
 ELSE
 DISPLAY "NINGUN REGISTRO SORT PROCESADO"
 DISPLAY "SE PRODUJO ALGUNA INCIDENCIA"
 END-IF.

 SORT-SALIDA-EXIT.
 EXIT.

# LECTURA DEL REGISTRO SORT
 RECUPERAR-SORT.
 INITIALIZE WRS-REG-SORT.
 SET NO-FIN-SORT TO TRUE.
 RETURN FSORT INTO WRS-REG-SORT
 AT END SET FIN-SORT TO TRUE.
 RECUPERAR-SORT-EXIT.
 EXIT.

# SEPARAMOS LOS PROCEDIMIENTOS POR REGIONES
 BUCLE-PRINCIPAL.
 EVALUATE TRUE
 WHEN WRS-REGION-ACTUAL = WS-REGION-ANTERIOR
 PERFORM TRATA-APELLIDO
 THRU TRATA-APELLIDO-EXIT
 WHEN WRS-REGION-ACTUAL NOT = WS-REGION-ANTERIOR
 PERFORM GRABAR-TABLA
 THRU GRABAR-TABLA-EXIT
 PERFORM GENERAR-LISTADO
 THRU GENERAR-LISTADO-EXIT
# INICIALIZAR LA TABLA PARA NUEVA REGION
 INITIALIZE TABLA-INFORME
 MOVE WRS-REGION-ACTUAL TO WS-REGION-ANTERIOR
 TABLA-REGION
 MOVE WRS-APELLIDO-ACTUAL TO WS-APELLIDO-ANTERIOR
 MOVE 1 TO WS-CONT-APELLIDO
 END-EVALUATE.

 PERFORM RECUPERAR-SORT
 THRU RECUPERAR-SORT-EXIT.

 BUCLE-PRINCIPAL-EXIT.
 EXIT.

# TRATAMIENTO DE IGUAL Y DISTINTO APELLIDO EN UNA MISMA REGION
 TRATA-APELLIDO.
 EVALUATE TRUE
 WHEN WRS-APELLIDO-ACTUAL = WS-APELLIDO-ANTERIOR
 ADD 1 TO WS-CONT-APELLIDO
 WHEN WRS-APELLIDO-ACTUAL NOT = WS-APELLIDO-ANTERIOR
 PERFORM GRABAR-TABLA
 THRU GRABAR-TABLA-EXIT
 MOVE WRS-APELLIDO-ACTUAL
 TO WS-APELLIDO-ANTERIOR
 MOVE 1 TO WS-CONT-APELLIDO
 END-EVALUATE.

 TRATA-APELLIDO-EXIT.
 EXIT.

# PROCESO DE GRABACIÓN DE LA TABLA CON LOS 10 APELLIDOS MAS
# COMUNES EN CADA REGION:
# EL PROCEDIMIENTO ES SIMILAR AL PROCESO DE VOTACIÓN USADO POR
# EJEMPLO EN EUROVISIÓN, ES DECIR SE COMPRUEBA EL NÚMERO DEL
# CONTADOR DE APELLIDOS, EN FUNCIÓN DE ESE VALOR, SE LE ADJUDICA
# O NO UNA POSICIÓN DE ENTRE LAS 10 POSIBLES
 GRABAR-TABLA.
 IF WS-CONT-APELLIDO > CONTAP(1)
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 10
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(1)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(1)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(2) AND
 (WS-CONT-APELLIDO < CONTAP(1) OR
 WS-CONT-APELLIDO = CONTAP(1))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 9
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(2)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(2)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF (WS-CONT-APELLIDO > CONTAP(3)) AND
 (WS-CONT-APELLIDO < CONTAP(2) OR
 WS-CONT-APELLIDO = CONTAP(2))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 8
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(3)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(3)
 GO TO GRABAR-TABLA-EXIT
 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(4) AND
 (WS-CONT-APELLIDO < CONTAP(3) OR
 WS-CONT-APELLIDO = CONTAP(3))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 7
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(4)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(4)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(5) AND
 (WS-CONT-APELLIDO < CONTAP(4) OR
 WS-CONT-APELLIDO = CONTAP(4))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 6
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(5)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(5)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(6) AND
 (WS-CONT-APELLIDO < CONTAP(5) OR
 WS-CONT-APELLIDO = CONTAP(5))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 5
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(6)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(6)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(7) AND
 (WS-CONT-APELLIDO < CONTAP(6) OR
 WS-CONT-APELLIDO = CONTAP(6))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 4
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(7)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(7)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(8) AND
 (WS-CONT-APELLIDO < CONTAP(7) OR
 WS-CONT-APELLIDO = CONTAP(7))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 3
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(8)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(8)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(9) AND
 (WS-CONT-APELLIDO < CONTAP(8) OR
 WS-CONT-APELLIDO = CONTAP(8))
 PERFORM VARYING WS-INDICE FROM 1 BY 1
 UNTIL WS-INDICE = 2
 MOVE CONTAP(10 - WS-INDICE) TO CONTAP(11 - WS-INDICE)
 MOVE APTABLA(10 - WS-INDICE) TO APTABLA(11 - WS-INDICE)
 END-PERFORM
 MOVE WS-CONT-APELLIDO TO CONTAP(9)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(9)
 GO TO GRABAR-TABLA-EXIT

 END-IF.
 IF WS-CONT-APELLIDO > CONTAP(10) AND
 (WS-CONT-APELLIDO < CONTAP(9) OR
 WS-CONT-APELLIDO = CONTAP(9))
 MOVE WS-CONT-APELLIDO TO CONTAP(10)
 MOVE WS-APELLIDO-ANTERIOR TO APTABLA(10)
 END-IF.
 GRABAR-TABLA-EXIT.
 EXIT.

 GENERAR-LISTADO.
 IF WS-CONT-LINEAS > 36
 PERFORM IMPRIME-CABECERA
 THRU IMPRIME-CABECERA-EXIT
 PERFORM IMPRIME-REGION
 THRU IMPRIME-REGION-EXIT
 ELSE
 PERFORM IMPRIME-REGION
 THRU IMPRIME-REGION-EXIT
 END-IF.

# BUCLE DE RECUPERACIÓN DE LOS DATOS DE LA TABLA DE UNA REGIÓN
# PARA SU IMPRESIÓN EN INFORME
 PERFORM VARYING WS-CONT-TABLA FROM 1 BY 1
 UNTIL WS-CONT-TABLA > 10
 IF WS-CONT-LINEAS > 38
 PERFORM CONTROL-CABECERA
 THRU CONTROL-CABECERA-EXIT
 END-IF
 INITIALIZE LI-REG-DETALLE
 MOVE APTABLA(WS-CONT-TABLA) TO LD-APELLIDO
 MOVE CONTAP(WS-CONT-TABLA) TO LD-NUMERO
 WRITE REG-INFORME FROM LI-REG-DETALLE
 ADD 1 TO WS-CONT-LINEAS
 END-PERFORM.

 GENERAR-LISTADO-EXIT.
 EXIT.

# CONTROLA EL SALTO DE PÁGINA SI EL CONTADOR SUPERA LAS 39 LÍNEAS
 CONTROL-CABECERA.
 PERFORM IMPRIME-CABECERA
 THRU IMPRIME-CABECERA-EXIT.
 PERFORM IMPRIME-REGION
 THRU IMPRIME-REGION-EXIT.
 CONTROL-CABECERA-EXIT.
 EXIT.

# IMPRIME LA CABECERA DEL INFORME
 IMPRIME-CABECERA.
 INITIALIZE REG-INFORME.
 ADD 1 TO WS-CONT-PAG.
 MOVE WS-CONT-PAG TO LT-PAGE.
 WRITE REG-INFORME FROM LI-REG-CAB0
 AFTER ADVANCING PAGE.
 INITIALIZE REG-INFORME.
 WRITE REG-INFORME FROM LI-REG-CAB1
 AFTER ADVANCING 1 LINE.
 INITIALIZE REG-INFORME.
 WRITE REG-INFORME FROM LI-REG-CAB2.
 MOVE 4 TO WS-CONT-LINEAS.
 IMPRIME-CABECERA-EXIT.
 EXIT.

# LÍNEA DE IMPRESIÓN PARA LA REGIÓN
 IMPRIME-REGION.
 INITIALIZE LI-REG-REGION.
 MOVE WS-REGION-ANTERIOR TO LD-REGION.
 WRITE REG-INFORME FROM LI-REG-REGION
 AFTER ADVANCING 1 LINE.
 ADD 2 TO WS-CONT-LINEAS.
 IMPRIME-REGION-EXIT.
 EXIT.

# PROCEDIMIENTO FINAL, MUESTRA VALORES Y RESULTADOS ERRÓNEOS
 FINALIZAR.
# DISPLAY '########################'.
# DISPLAY '# PROGRAMA PROBLEMA 10 #'.
# DISPLAY '########################'.
# DISPLAY 'FECHA EJECUCION: ' LD-FECHA.
 IF WS-CONT-LINEAS > 0
 PERFORM IMPRIME-FINALES
 THRU IMPRIME-FINALES-EXIT
 ELSE
 DISPLAY 'NO SE IMPRIMIO NINGUNA LINEA EN EL INFORME'
 DISPLAY 'COMPROBAR APERTURA FICHEROS Y REGISTROS SORT'
 END-IF.
 DISPLAY 'REGISTROS LEIDOS EN FICHERO CENSO: '
 WS-CONT-CENSO.
 DISPLAY 'REGISTROS GRABADOS EN FICHERO SORT: '
 WS-CONT-SORT.
 CLOSE CENSO INFORME.
 FINALIZAR-EXIT.
 EXIT.

#IMPRIME FIN DE IMPRESIÓN Y PROGRAMADOR DE LA APLICACIÓN
 IMPRIME-FINALES.
 COMPUTE WS-LINEA-IMPRESION = 44 - WS-CONT-LINEAS.
 INITIALIZE LI-REG-FIN.
 WRITE REG-INFORME FROM LI-REG-FIN
 AFTER ADVANCING WS-LINEA-IMPRESION LINES.
 INITIALIZE LI-REG-AUTOR.
 WRITE REG-INFORME FROM LI-REG-AUTOR
 AFTER ADVANCING 2 LINES.
 IMPRIME-FINALES-EXIT.
 EXIT.